Masmiseim36/nxpSDK/boards/evkmcimx7ulp/demo_apps/wireless_uart_bridge/pin_mux.h
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_


/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/* PTA25 (number AG20), A7_POW_EN# */
#define BOARD_A7_POW_EN_PERIPHERAL                                           PTA   /*!< Device name: PTA */
#define BOARD_A7_POW_EN_SIGNAL                                              port   /*!< PTA signal: port */
#define BOARD_A7_POW_EN_CHANNEL                                               25   /*!< PTA port channel: 25 */
#define BOARD_A7_POW_EN_PIN_NAME                                           PTA25   /*!< Pin name */
#define BOARD_A7_POW_EN_PIN_FUNCTION_ID                       IOMUXC_PTA25_PTA25   /*!< Pin function id */
#define BOARD_A7_POW_EN_LABEL                                       "A7_POW_EN#"   /*!< Label */
#define BOARD_A7_POW_EN_NAME                                         "A7_POW_EN"   /*!< Identifier name */

/* PTA19 (number AB19), UART0_RX */
#define BOARD_UART0_RX_PERIPHERAL                                        LPUART0   /*!< Device name: LPUART0 */
#define BOARD_UART0_RX_SIGNAL                                          lpuart_rx   /*!< LPUART0 signal: lpuart_rx */
#define BOARD_UART0_RX_PIN_NAME                                            PTA19   /*!< Pin name */
#define BOARD_UART0_RX_PIN_FUNCTION_ID                   IOMUXC_PTA19_LPUART0_RX   /*!< Pin function id */
#define BOARD_UART0_RX_LABEL                                          "UART0_RX"   /*!< Label */
#define BOARD_UART0_RX_NAME                                           "UART0_RX"   /*!< Identifier name */

/* PTA18 (number AC19), UART0_TX */
#define BOARD_UART0_TX_PERIPHERAL                                        LPUART0   /*!< Device name: LPUART0 */
#define BOARD_UART0_TX_SIGNAL                                          lpuart_tx   /*!< LPUART0 signal: lpuart_tx */
#define BOARD_UART0_TX_PIN_NAME                                            PTA18   /*!< Pin name */
#define BOARD_UART0_TX_PIN_FUNCTION_ID                   IOMUXC_PTA18_LPUART0_TX   /*!< Pin function id */
#define BOARD_UART0_TX_LABEL                                          "UART0_TX"   /*!< Label */
#define BOARD_UART0_TX_NAME                                           "UART0_TX"   /*!< Identifier name */

/* PTA4 (number AD15), I2S0_MCLK */
#define BOARD_I2S0_MCLK_PERIPHERAL                                          I2S0   /*!< Device name: I2S0 */
#define BOARD_I2S0_MCLK_SIGNAL                                          i2s_mclk   /*!< I2S0 signal: i2s_mclk */
#define BOARD_I2S0_MCLK_PIN_NAME                                            PTA4   /*!< Pin name */
#define BOARD_I2S0_MCLK_PIN_FUNCTION_ID                    IOMUXC_PTA4_I2S0_MCLK   /*!< Pin function id */
#define BOARD_I2S0_MCLK_LABEL                                        "I2S0_MCLK"   /*!< Label */
#define BOARD_I2S0_MCLK_NAME                                         "I2S0_MCLK"   /*!< Identifier name */

/* PTA2 (number AG14), I2S0_RXD0 */
#define BOARD_I2S0_RXD0_PERIPHERAL                                          I2S0   /*!< Device name: I2S0 */
#define BOARD_I2S0_RXD0_SIGNAL                                           i2s_rxd   /*!< I2S0 signal: i2s_rxd */
#define BOARD_I2S0_RXD0_CHANNEL                                                0   /*!< I2S0 i2s_rxd channel: 0 */
#define BOARD_I2S0_RXD0_PIN_NAME                                            PTA2   /*!< Pin name */
#define BOARD_I2S0_RXD0_PIN_FUNCTION_ID                    IOMUXC_PTA2_I2S0_RXD0   /*!< Pin function id */
#define BOARD_I2S0_RXD0_LABEL                                        "I2S0_RXD0"   /*!< Label */
#define BOARD_I2S0_RXD0_NAME                                         "I2S0_RXD0"   /*!< Identifier name */

/* PTA5 (number AC15), I2S0_TX_BCLK */
#define BOARD_I2S0_TX_BCLK_PERIPHERAL                                       I2S0   /*!< Device name: I2S0 */
#define BOARD_I2S0_TX_BCLK_SIGNAL                                    i2s_tx_bclk   /*!< I2S0 signal: i2s_tx_bclk */
#define BOARD_I2S0_TX_BCLK_PIN_NAME                                         PTA5   /*!< Pin name */
#define BOARD_I2S0_TX_BCLK_PIN_FUNCTION_ID              IOMUXC_PTA5_I2S0_TX_BCLK   /*!< Pin function id */
#define BOARD_I2S0_TX_BCLK_LABEL                                  "I2S0_TX_BCLK"   /*!< Label */
#define BOARD_I2S0_TX_BCLK_NAME                                   "I2S0_TX_BCLK"   /*!< Identifier name */

/* PTA6 (number AB15), I2S0_TX_FS */
#define BOARD_I2S0_TX_FS_PERIPHERAL                                         I2S0   /*!< Device name: I2S0 */
#define BOARD_I2S0_TX_FS_SIGNAL                                        i2s_tx_fs   /*!< I2S0 signal: i2s_tx_fs */
#define BOARD_I2S0_TX_FS_PIN_NAME                                           PTA6   /*!< Pin name */
#define BOARD_I2S0_TX_FS_PIN_FUNCTION_ID                  IOMUXC_PTA6_I2S0_TX_FS   /*!< Pin function id */
#define BOARD_I2S0_TX_FS_LABEL                                      "I2S0_TX_FS"   /*!< Label */
#define BOARD_I2S0_TX_FS_NAME                                       "I2S0_TX_FS"   /*!< Identifier name */

/* PTA7 (number AD14), I2S0_TXD0 */
#define BOARD_I2S0_TXD0_PERIPHERAL                                          I2S0   /*!< Device name: I2S0 */
#define BOARD_I2S0_TXD0_SIGNAL                                           i2s_txd   /*!< I2S0 signal: i2s_txd */
#define BOARD_I2S0_TXD0_CHANNEL                                                0   /*!< I2S0 i2s_txd channel: 0 */
#define BOARD_I2S0_TXD0_PIN_NAME                                            PTA7   /*!< Pin name */
#define BOARD_I2S0_TXD0_PIN_FUNCTION_ID                    IOMUXC_PTA7_I2S0_TXD0   /*!< Pin function id */
#define BOARD_I2S0_TXD0_LABEL                                        "I2S0_TXD0"   /*!< Label */
#define BOARD_I2S0_TXD0_NAME                                         "I2S0_TXD0"   /*!< Identifier name */

/* PTA3 (number AF14), VOL+ */
#define BOARD_VOL_UP_PERIPHERAL                                              PTA   /*!< Device name: PTA */
#define BOARD_VOL_UP_SIGNAL                                                 port   /*!< PTA signal: port */
#define BOARD_VOL_UP_CHANNEL                                                   3   /*!< PTA port channel: 3 */
#define BOARD_VOL_UP_PIN_NAME                                               PTA3   /*!< Pin name */
#define BOARD_VOL_UP_PIN_FUNCTION_ID                            IOMUXC_PTA3_PTA3   /*!< Pin function id */
#define BOARD_VOL_UP_LABEL                                                "VOL+"   /*!< Label */
#define BOARD_VOL_UP_NAME                                               "VOL_UP"   /*!< Identifier name */

/* PTA13 (number AF16), VOL- */
#define BOARD_VOL_DOWN_PERIPHERAL                                            PTA   /*!< Device name: PTA */
#define BOARD_VOL_DOWN_SIGNAL                                               port   /*!< PTA signal: port */
#define BOARD_VOL_DOWN_CHANNEL                                                13   /*!< PTA port channel: 13 */
#define BOARD_VOL_DOWN_PIN_NAME                                            PTA13   /*!< Pin name */
#define BOARD_VOL_DOWN_PIN_FUNCTION_ID                        IOMUXC_PTA13_PTA13   /*!< Pin function id */
#define BOARD_VOL_DOWN_LABEL                                              "VOL-"   /*!< Label */
#define BOARD_VOL_DOWN_NAME                                           "VOL_DOWN"   /*!< Identifier name */

/* PTA14 (number AF17), WL_REG_ON */
#define BOARD_WL_REG_ON_PERIPHERAL                                           PTA   /*!< Device name: PTA */
#define BOARD_WL_REG_ON_SIGNAL                                              port   /*!< PTA signal: port */
#define BOARD_WL_REG_ON_CHANNEL                                               14   /*!< PTA port channel: 14 */
#define BOARD_WL_REG_ON_PIN_NAME                                           PTA14   /*!< Pin name */
#define BOARD_WL_REG_ON_PIN_FUNCTION_ID                       IOMUXC_PTA14_PTA14   /*!< Pin function id */
#define BOARD_WL_REG_ON_LABEL                                        "WL_REG_ON"   /*!< Label */
#define BOARD_WL_REG_ON_NAME                                         "WL_REG_ON"   /*!< Identifier name */

/* PTA15 (number AF18), BT_REG_ON */
#define BOARD_BT_REG_ON_PERIPHERAL                                           PTA   /*!< Device name: PTA */
#define BOARD_BT_REG_ON_SIGNAL                                              port   /*!< PTA signal: port */
#define BOARD_BT_REG_ON_CHANNEL                                               15   /*!< PTA port channel: 15 */
#define BOARD_BT_REG_ON_PIN_NAME                                           PTA15   /*!< Pin name */
#define BOARD_BT_REG_ON_PIN_FUNCTION_ID                       IOMUXC_PTA15_PTA15   /*!< Pin function id */
#define BOARD_BT_REG_ON_LABEL                                        "BT_REG_ON"   /*!< Label */
#define BOARD_BT_REG_ON_NAME                                         "BT_REG_ON"   /*!< Identifier name */

